## PANDAS

In [2]:
import numpy as np
import pandas as pd

### series
Creating a Series by passing a list of values, letting pandas create a default integer index:

In [3]:
ser = pd.Series([1, 3, 5, np.nan, 6, 8])
print(ser)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
# index
ser.index

RangeIndex(start=0, stop=6, step=1)

In [5]:
ser.index.values# we get here index values

array([0, 1, 2, 3, 4, 5], dtype=int64)

In [6]:
ser.values# we get here values of series

array([ 1.,  3.,  5., nan,  6.,  8.])

In [7]:
# example 1
marks = pd.Series([56,67,42,39,96,84])
names = ['rahul','ramesh','raghav','ravi','raju','rani']
marks.index=names
print(marks)

rahul     56
ramesh    67
raghav    42
ravi      39
raju      96
rani      84
dtype: int64

In [8]:
marks1 = pd.Series([66,77,33,66,44,66],index =names)
# marks1.index = names
print(marks1)

rahul     66
ramesh    77
raghav    33
ravi      66
raju      44
rani      66
dtype: int64

In [10]:
# average marks
avg_marks = (marks+marks1)/2
avg_marks

rahul     61.0
ramesh    72.0
raghav    37.5
ravi      52.5
raju      70.0
rani      75.0
dtype: float64

In [11]:
re_mark = pd.Series([56],index=['raghav'])
re_mark

raghav    56
dtype: int64

In [12]:
avg_marks[re_mark.index] = re_mark

In [13]:
avg_marks

rahul     61.0
ramesh    72.0
raghav    56.0
ravi      52.5
raju      70.0
rani      75.0
dtype: float64

In [14]:
avg_marks>70

rahul     False
ramesh     True
raghav    False
ravi      False
raju      False
rani       True
dtype: bool

In [15]:
avg_marks[avg_marks>70]

ramesh    72.0
rani      75.0
dtype: float64

In [16]:
d = dict(marks)

In [17]:
d

{'rahul': 56, 'ramesh': 67, 'raghav': 42, 'ravi': 39, 'raju': 96, 'rani': 84}

In [18]:
pd.Series(d)

rahul     56
ramesh    67
raghav    42
ravi      39
raju      96
rani      84
dtype: int64

In [19]:
avg_marks

rahul     61.0
ramesh    72.0
raghav    56.0
ravi      52.5
raju      70.0
rani      75.0
dtype: float64

In [20]:
avg_marks[0]

61.0

In [21]:
tech =pd.Series(np.squeeze(np.random.randint(120,160,size=[6,1])))
office =pd.Series(np.squeeze(np.random.randint(60,99,size=[6,1])))
furnit =pd.Series(np.squeeze(np.random.randint(100,170,size=[6,1])))

In [22]:
tech

0    130
1    142
2    135
3    137
4    138
5    121
dtype: int32

In [23]:
market_data = pd.concat([tech,office,furnit],axis=1)
market_data

     0   1    2
0  130  64  109
1  142  65  152
2  135  74  153
3  137  96  129
4  138  60  124
5  121  69  112

In [24]:
type(market_data)

pandas.core.frame.DataFrame

In [25]:
market_data.columns= ['tech','office','furnit']

In [26]:
market_data.index= np.arange(2014,2020)

In [27]:
market_data

      tech  office  furnit
2014   130      64     109
2015   142      65     152
2016   135      74     153
2017   137      96     129
2018   138      60     124
2019   121      69     112

In [29]:
market_data[['tech','furnit']] # acess by column names

      tech  furnit
2014   130     109
2015   142     152
2016   135     153
2017   137     129
2018   138     124
2019   121     112

In [30]:
d1 = market_data.iloc[:3,:] # acess using columns

In [31]:
d1

      tech  office  furnit
2014   130      64     109
2015   142      65     152
2016   135      74     153

In [36]:
 market_data.iloc[3:]

      tech  office  furnit
2017   137      96     129
2018   138      60     124
2019   121      69     112

In [37]:
market_data.loc[[2014,2017]] # acess using rows names

      tech  office  furnit
2014   130      64     109
2017   137      96     129

In [42]:
market_data.loc[2015:2018]

      tech  office  furnit
2015   142      65     152
2016   135      74     153
2017   137      96     129
2018   138      60     124

In [43]:
market_data['total_sales'] = market_data['tech']+market_data['office']+market_data['furnit']

In [44]:
market_data

      tech  office  furnit  total_sales
2014   130      64     109          303
2015   142      65     152          359
2016   135      74     153          362
2017   137      96     129          362
2018   138      60     124          322
2019   121      69     112          302

In [45]:
 df2 = pd.DataFrame(
     {
       "A": 1.0,
       "B": pd.Timestamp("20130102"),
       "C": pd.Series(1, index=list(range(4)), dtype="float32"),
       "D": np.array([3] * 4, dtype="int32"),
       "E": pd.Categorical(["test", "train", "test", "train"]),
       "F": "foo",
     }
     )

In [46]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [49]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

The columns of the resulting DataFrame have different dtypes.

In [50]:
# Here is how to view the top and bottom rows of the frame:
df2.head(2)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo

In [51]:
df2.tail(2)

     A          B    C  D      E    F
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [52]:
# Display the index, columns:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [53]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [76]:
years = np.arange(2015,2021)
df = pd.DataFrame(np.random.randn(6, 4), index=years, columns=list("ABCD"))

In [77]:
df

             A         B         C         D
2015 -1.485368 -1.760963  0.348442 -0.682696
2016  0.127299 -0.933150 -0.007996 -2.497036
2017 -0.424508 -1.201448  0.271089 -0.379712
2018  1.466349  1.112846  0.734383 -0.460514
2019 -0.320160  0.334722  1.151702 -0.518012
2020  1.048291  0.198797  0.549848  0.324703

In [78]:
# describe() shows a quick statistic summary of your data:

df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.068651 -0.374866  0.507912 -0.702211
std    1.070145  1.091977  0.403780  0.945799
min   -1.485368 -1.760963 -0.007996 -2.497036
25%   -0.398421 -1.134373  0.290428 -0.641525
50%   -0.096430 -0.367176  0.449145 -0.489263
75%    0.818043  0.300741  0.688250 -0.399913
max    1.466349  1.112846  1.151702  0.324703

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 2015 to 2020
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [80]:
# Transposing your data:
df.T

       2015      2016      2017      2018      2019      2020
A -1.485368  0.127299 -0.424508  1.466349 -0.320160  1.048291
B -1.760963 -0.933150 -1.201448  1.112846  0.334722  0.198797
C  0.348442 -0.007996  0.271089  0.734383  1.151702  0.549848
D -0.682696 -2.497036 -0.379712 -0.460514 -0.518012  0.324703

In [85]:
# Sorting by an axis:
df.sort_index(axis=0, ascending=False)

             A         B         C         D
2020  1.048291  0.198797  0.549848  0.324703
2019 -0.320160  0.334722  1.151702 -0.518012
2018  1.466349  1.112846  0.734383 -0.460514
2017 -0.424508 -1.201448  0.271089 -0.379712
2016  0.127299 -0.933150 -0.007996 -2.497036
2015 -1.485368 -1.760963  0.348442 -0.682696

In [86]:
# Sorting by values:
df.sort_values('B')

             A         B         C         D
2015 -1.485368 -1.760963  0.348442 -0.682696
2017 -0.424508 -1.201448  0.271089 -0.379712
2016  0.127299 -0.933150 -0.007996 -2.497036
2020  1.048291  0.198797  0.549848  0.324703
2019 -0.320160  0.334722  1.151702 -0.518012
2018  1.466349  1.112846  0.734383 -0.460514

In [87]:
# Selecting a single column, which yields a Series, equivalent to df.A:
df['A']

2015   -1.485368
2016    0.127299
2017   -0.424508
2018    1.466349
2019   -0.320160
2020    1.048291
Name: A, dtype: float64

In [88]:
# Selecting via [], which slices the rows.
df[0:3]

             A         B         C         D
2015 -1.485368 -1.760963  0.348442 -0.682696
2016  0.127299 -0.933150 -0.007996 -2.497036
2017 -0.424508 -1.201448  0.271089 -0.379712

### Selection by label

In [99]:
df.loc[2015:2018]

             A         B         C         D
2015 -1.485368 -1.760963  0.348442 -0.682696
2016  0.127299 -0.933150 -0.007996 -2.497036
2017 -0.424508 -1.201448  0.271089 -0.379712
2018  1.466349  1.112846  0.734383 -0.460514

In [100]:
df.loc[:,["A","C"]]

             A         C
2015 -1.485368  0.348442
2016  0.127299 -0.007996
2017 -0.424508  0.271089
2018  1.466349  0.734383
2019 -0.320160  1.151702
2020  1.048291  0.549848

In [102]:
df.loc[2016:,"B":]

             B         C         D
2016 -0.933150 -0.007996 -2.497036
2017 -1.201448  0.271089 -0.379712
2018  1.112846  0.734383 -0.460514
2019  0.334722  1.151702 -0.518012
2020  0.198797  0.549848  0.324703

In [105]:
df.loc[[2016,2019],["A","D"]]

             A         D
2016  0.127299 -2.497036
2019 -0.320160 -0.518012

### Selection by position

In [106]:
df.iloc[3]

A    1.466349
B    1.112846
C    0.734383
D   -0.460514
Name: 2018, dtype: float64

In [107]:
df.iloc[3:5, 0:2]

             A         B
2018  1.466349  1.112846
2019 -0.320160  0.334722

In [108]:
df.iloc[[1, 2, 4], [0, 2]]

             A         C
2016  0.127299 -0.007996
2017 -0.424508  0.271089
2019 -0.320160  1.151702

In [109]:
df.iloc[1:3, :]

             A         B         C         D
2016  0.127299 -0.933150 -0.007996 -2.497036
2017 -0.424508 -1.201448  0.271089 -0.379712

In [110]:
df.iloc[:, 1:3]

             B         C
2015 -1.760963  0.348442
2016 -0.933150 -0.007996
2017 -1.201448  0.271089
2018  1.112846  0.734383
2019  0.334722  1.151702
2020  0.198797  0.549848

In [111]:
df.iloc[1, 1]

-0.9331500357341149

### Boolean indexing

In [112]:
df[df["A"] > 0]

             A         B         C         D
2016  0.127299 -0.933150 -0.007996 -2.497036
2018  1.466349  1.112846  0.734383 -0.460514
2020  1.048291  0.198797  0.549848  0.324703

In [113]:
 df[df > 0]

             A         B         C         D
2015       NaN       NaN  0.348442       NaN
2016  0.127299       NaN       NaN       NaN
2017       NaN       NaN  0.271089       NaN
2018  1.466349  1.112846  0.734383       NaN
2019       NaN  0.334722  1.151702       NaN
2020  1.048291  0.198797  0.549848  0.324703